# CentralPath Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasicFileInfo..::..CentralPath Property
BasicFileInfo Class See Also
---
Returns the central model path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string CentralPath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CentralPath As String
	Get
```

Visual C++
---
```text
public:
property String^ CentralPath {
	String^ get ();
}
```

# See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace